cask_args appdir: "/Applications"

brew 'mas'
brew 'git'
brew 'python@3.9'
brew 'go'
brew 'kubebuilder'
brew 'kind'
brew 'nodebrew'
brew 'watch'
brew 'fish'
brew 'ffmpeg'
brew 'mtr'
brew 'httping'
brew 'nmap'
brew 'telnet'
brew 'wget'
brew 'curl'
brew 'tree'
brew 'htop'
brew 'youtube-dl'
brew 'sl'
# tap 'heroku/brew'
# brew 'heroku'

cask 'shiftit' #画面分割するやつ
cask 'scroll-reverser'
cask 'clipy'
cask 'wireshark'
cask 'android-platform-tools'
cask 'adobe-creative-cloud'
cask 'docker'
cask 'termius'
cask 'visual-studio-code'
# cask 'intellij-idea'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'google-drive'
cask 'firefox'
cask 'zoom'
cask 'vlc'
cask 'discord'
cask 'obs'
# cask 'microsoft-office'
# cask 'slack'
# cask 'coteditor'

## mas(must AppleID)
mas 'RunCat', id: 1429033973
mas 'Slack for Desktop', id: 803453959
mas 'LINE', id: 539883307
mas 'CotEditor', id: 1024640650
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'WinArchiver Lite', id: 414855915
mas 'Bitwarden', id: 1352778147
mas 'Display Menu', id: 549083868
mas 'Kindle', id: 405399194

## mas(must ID) Paid apps
mas 'Final Cut Pro', 424389933
mas 'Logic Pro', 634148309
mas 'Motion', 434290957
mas 'MainStage', 634159523
mas 'Compressor', 424390742
