cask_args appdir: "/Applications"

brew 'mas'
brew 'git'
brew 'python@3.9'
brew 'go'
brew 'nodebrew'
brew 'fish'
brew 'ffmpeg'
brew 'mtr'
brew 'nmap'
brew 'telnet'
brew 'wget'
brew 'curl'
brew 'tree'
brew 'sl'
# tap 'heroku/brew'
# brew 'heroku'

cask 'shiftit' #画面分割するやつ
cask 'scroll-reverser'
cask 'clipy'
cask 'wireshark'
cask 'adobe-creative-cloud'
cask 'docker'
cask 'termius'
cask 'visual-studio-code'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'google-drive'
cask 'firefox'
cask 'zoom'
cask 'vlc'
cask 'discord'
# cask 'slack'
# cask 'coteditor'

## mas(must AppleID)
mas 'RunCat', id: 1429033973
mas 'Slack for Desktop', id: 803453959
mas 'LINE', id: 539883307
mas 'CotEditor', id: 1024640650
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'WinArchiver Lite', id: 414855915
