cask_args appdir: "/Applications"

brew 'mas'
brew 'git'
brew 'go'
brew 'kind'
brew 'nodebrew'
brew 'watch'
brew 'fish'
brew 'ffmpeg'
brew 'mtr'
brew 'httping'
brew 'nmap'
brew 'openssl'
brew 'wget'
brew 'curl'
brew 'tree'
brew 'htop'
brew 'yt-dlp'
brew 'sl'
brew 'ipcalc'
brew 'tmux'
brew 'jq'
brew 'pwgen'
# tap 'heroku/brew'
# brew 'heroku'

cask 'shiftit'
cask 'scroll-reverser'
cask 'clipy'
cask 'wireshark'
cask 'android-platform-tools'
cask 'adobe-creative-cloud'
cask 'docker'
cask 'visual-studio-code'
# cask 'intellij-idea'
cask 'google-chrome'
cask 'google-japanese-ime'
cask 'firefox'
cask 'zoom'
cask 'vlc'
cask 'discord'
cask 'obs'
# cask 'microsoft-office'

## mas(must AppleID)
mas 'RunCat', id: 1429033973
mas 'Slack for Desktop', id: 803453959
mas 'LINE', id: 539883307
mas 'CotEditor', id: 1024640650
mas 'Microsoft Remote Desktop', id: 1295203466
mas 'WinArchiver Lite', id: 414855915
# mas 'Bitwarden', id: 1352778147
mas 'Display Menu', id: 549083868
mas 'Kindle', id: 405399194
mas 'WireGuard', id: 1451685025

## mas(must ID) Paid apps
mas 'Final Cut Pro', id: 424389933
mas 'Logic Pro', id: 634148309
mas 'Motion', id: 434290957
mas 'MainStage', id: 634159523
mas 'Compressor', id: 424390742
